backend/app/controllers/api/v1/products_controller.rb

SELECT "products".* FROM "products" WHERE (lower(name) LIKE '%zelda%' OR lower(description) LIKE '%zelda%' OR lower(author) LIKE '%zelda%' OR lower(genre) LIKE '%zelda%')
---
  def index
    if params[:keyword].present?
      # Search by name, description, author, or genre  trỏ 35-60
      keyword = "%#{params[:keyword]}%"
      @products = ::Product.where(
        "name LIKE ? OR description LIKE ? OR author LIKE ? OR genre LIKE ?",
        keyword, keyword, keyword, keyword
      )
    else
      @products = ::Product.all

INSERT INTO "products" ("name", "description", "author", "release_year", "price", "genre", "rating", "created_at", "updated_at") VALUES ('進撃の巨人', '巨人がすべてを支配する世界。人類が巨人に立ち向かうダークファンタジー。', '諫山創', 2010, 550.0, '漫画', 5, '2025-10-31 02:08:52.401749', '2025-10-31 02:08:52.401749') RETURNING "id"
---
  def create
    @product = ::Product.new(product_params)
    if @product.save

UPDATE "products" SET "price" = 670.0, "updated_at" = '2025-10-31 01:45:47.764836' WHERE "products"."id" = 41
---
  def update
    if @product.update(product_params)

SELECT "products".* FROM "products" WHERE "products"."id" = 41 LIMIT 1
---
  def set_product
    @product = ::Product.find(params[:id])